architecture/architecture.org
This file describes the main data structures for the ASM model (but not the actual syntax for using the model and neither the equations)

* Class: State Variables
** Inputs
*** Q (ML/d, flowrate)
*** Components (mg/L)
- S_VFA  - Biodegradable Soluble Organics (BSO) (volatile fatty acids)
- S_FBSO - Biodegradable Soluble Organics (BSO) (fermentable organics)
- X_BPO  - Biodegradable Particulate Organics (BPO)
- X_UPO  - Unbiodegradable Particulate Organics (UPO)
- S_USO  - Unbiodegradable Soluble Organics (USO)
- X_iSS  - Inert Suspended Solids (sand)
- S_FSA  - Inorganic Free Saline Ammonia (NH_4)
- S_OP   - Inorganic OrthoPhosphate (PO_4)
- S_NOx  - Inorganic Nitrite and Nitrate (NO_2 + NO_3) (not part of TKN)
- X_OHO  - Ordinary Heterotrophic Organisms (expressed as COD) influent OHO should always be 0 (model assumption)
*** Mass ratios
| component | COD       | C        | N        | P        |
|-----------+-----------+----------+----------+----------|
| S_VFA     | f_CV_VFA  | f_C_VFA  | f_N_VFA  | f_P_VFA  |
| S_FBSO    | f_CV_FBSO | f_C_FBSO | f_N_FBSO | f_P_FBSO |
| X_BPO     | f_CV_BPO  | f_C_BPO  | f_N_BPO  | f_P_BPO  |
| S_UPO     | f_CV_UPO  | f_C_UPO  | f_N_UPO  | f_P_UPO  |
| S_USO     | f_CV_USO  | f_C_USO  | f_N_USO  | f_P_USO  |
| X_OHO     | f_CV_OHO  | f_C_OHO  | f_N_OHO  | f_P_OHO  |
|-----------+-----------+----------+----------+----------|
** Technologies
"Technologies" are methods of the state variables class. Each technology call creates an effluent and a wastage objects which are "state variables", and another object called "process variables".
*** Primary settler
**** Inputs
- fw          (ø, fraction of input Q that goes to wastage)
- removal_BPO (%, removal of X_BPO)
- removal_UPO (%, removal of X_UPO)
- removal_iSS (%, removal of X_iSS)
**** Outputs
- Primary effluent (state variables object)
- Primary wastage (state variables object)
*** Activated Sludge
**** Inputs
- T (ºC, temperature)
- Vp (m^3, reactor volume)
- Rs (days, solids retention time or sludge age)
- RAS (ø, SST underflow recycle ratio)
- waste_from (string, 'reactor' or 'sst')
- mass_FeCl3 (kgFeCl3, mass of FeCl3 added for chemical P removal)
**** Outputs (process variables)
- fSus        (gUSO/gCOD,   USO/COD ratio (influent))
- fSup        (gUPO/gCOD,   UPO/COD ratio (influent))
- Ns          (mgN/L,       N required for sludge production)
- Ps          (mgN/L,       P required for sludge production)
- HRT         (hour,        Nominal Hydraulic Retention Time)
- bHT         (1/d,         OHO Endogenous respiration rate corrected by temperature)
- f_XBH       (gVSS·d/gCOD, OHO Biomass production rate)
- MX_BH       (kgVSS,       OHO Biomass produced VSS)
- MX_EH       (kgVSS,       OHO Endogenous residue VSS)
- MX_I        (kgVSS,       Unbiodegradable organics VSS)
- MX_V        (kgVSS,       Volatile Suspended Solids)
- MX_IO       (kgiSS,       Inert Solids (influent+biomass))
- MX_T        (kgTSS,       Total Suspended Solids)
- X_V         (kgVSS/m3,    VSS concentration in SST)
- X_T         (kgTSS/m3,    TSS concentration in SST)
- fi          (gVSS/gTSS,   VSS/TSS ratio)
- f_avOHO     (gOHO/gVSS,   Active fraction of the sludge (VSS))
- f_atOHO     (gOHO/gTSS,   Active fraction of the sludge (TSS))
- FOc         (kgO/d,       Carbonaceous Oxygen Demand)
- FOn         (kgO/d,       Nitrogenous Oxygen Demand)
- FOt         (kgO/d,       Total Oxygen Demand)
- OUR         (mgO/L·h,     Oxygen Uptake Rate)
- Qr          (ML/d,        SST recycle flowrate)
- f_RAS       (ø,           SST concentrating factor)
- X_RAS       (kg/m3,       SST recycle flow TSS concentration)
- f           (ø,           Wastage concentrating factor)
- COD_balance (%,           COD balance)
- N_balance   (%,           N balance)
- Nae_balance (%,           Ammonia balance)
- P_balance   (%,           P balance)
*** Chemical P removal
**** Inputs
- Q (ML/d, flowrate)
- PO4i (mg/L, P available for chemical P removal, (calculated automatically in activated sludge function))
- mass_FeCl3 (kg/d FeCl3 added)
**** Outputs
- Fe_P_mole_ratio  (molFe/molP, Fe/P mole ratio (Fe added for P available))
- PO4e             (mgP/L,      PO4 effluent)
- PO4_removed      (kgP/d,      P removed)
- extra_iSS        (kgiSS/d,    iSS produced by FeCl3 coprecipitation (Fe(OH)3 and Fe(1.6)H2PO4(OH)3.8))
*** Nitrification
