architecture/architecture.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>architecture</title>
<!-- 2019-01-14 lun 17:41 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Lluís Bosch" />
</head>
<body>
<div id="content">
<h1 class="title">architecture</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Class: State Variables</a>
<ul>
<li><a href="#sec-1-1">1.1. Inputs</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1. Q (ML/d, flowrate)</a></li>
<li><a href="#sec-1-1-2">1.1.2. Components (mg/L)</a></li>
<li><a href="#sec-1-1-3">1.1.3. Mass ratios</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2. Technologies</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1. Primary settler</a></li>
<li><a href="#sec-1-2-2">1.2.2. Activated Sludge</a></li>
<li><a href="#sec-1-2-3">1.2.3. Chemical P removal</a></li>
<li><a href="#sec-1-2-4">1.2.4. Nitrification</a></li>
<li><a href="#sec-1-2-5">1.2.5. Denitrification</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3. Outputs</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. Totals</a></li>
<li><a href="#sec-1-3-2">1.3.2. Fluxes</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">2. Kinetic constants</a>
<ul>
<li><a href="#sec-2-1">2.1. Activated sludge</a></li>
<li><a href="#sec-2-2">2.2. Nitrification</a></li>
<li><a href="#sec-2-3">2.3. Denitrification</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Class: Plant</a>
<ul>
<li><a href="#sec-3-1">3.1. Inputs</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1. Influent (state variables object)</a></li>
<li><a href="#sec-3-1-2">3.1.2. Configuration object</a></li>
<li><a href="#sec-3-1-3">3.1.3. Parameters object</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2. Outputs</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. Process variables (varies with configuration, depending on the technologies activated)</a></li>
<li><a href="#sec-3-2-2">3.2.2. Effluents</a></li>
<li><a href="#sec-3-2-3">3.2.3. Wastages</a></li>
<li><a href="#sec-3-2-4">3.2.4. Possible errors (array of strings)</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This file describes the main data structures for the ASM model (but not the actual syntax for using the model and neither the equations)
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Class: State Variables</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Inputs</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> Q (ML/d, flowrate)</h4>
</div>
<div id="outline-container-sec-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> Components (mg/L)</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>S<sub>VFA</sub>  - Biodegradable Soluble Organics (BSO) (volatile fatty acids)
</li>
<li>S<sub>FBSO</sub> - Biodegradable Soluble Organics (BSO) (fermentable organics)
</li>
<li>X<sub>BPO</sub>  - Biodegradable Particulate Organics (BPO)
</li>
<li>X<sub>UPO</sub>  - Unbiodegradable Particulate Organics (UPO)
</li>
<li>S<sub>USO</sub>  - Unbiodegradable Soluble Organics (USO)
</li>
<li>X<sub>iSS</sub>  - Inert Suspended Solids (sand)
</li>
<li>S<sub>FSA</sub>  - Inorganic Free Saline Ammonia (NH<sub>4</sub>)
</li>
<li>S<sub>OP</sub>   - Inorganic OrthoPhosphate (PO<sub>4</sub>)
</li>
<li>S<sub>NOx</sub>  - Inorganic Nitrite and Nitrate (NO<sub>2</sub> + NO<sub>3</sub>) (not part of TKN)
</li>
<li>X<sub>OHO</sub>  - Ordinary Heterotrophic Organisms (expressed as COD) influent OHO should always be 0 (model assumption)
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> Mass ratios</h4>
<div class="outline-text-4" id="text-1-1-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">component</th>
<th scope="col" class="left">COD</th>
<th scope="col" class="left">C</th>
<th scope="col" class="left">N</th>
<th scope="col" class="left">P</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">S<sub>VFA</sub></td>
<td class="left">f<sub>CV</sub><sub>VFA</sub></td>
<td class="left">f<sub>C</sub><sub>VFA</sub></td>
<td class="left">f<sub>N</sub><sub>VFA</sub></td>
<td class="left">f<sub>P</sub><sub>VFA</sub></td>
</tr>

<tr>
<td class="left">S<sub>FBSO</sub></td>
<td class="left">f<sub>CV</sub><sub>FBSO</sub></td>
<td class="left">f<sub>C</sub><sub>FBSO</sub></td>
<td class="left">f<sub>N</sub><sub>FBSO</sub></td>
<td class="left">f<sub>P</sub><sub>FBSO</sub></td>
</tr>

<tr>
<td class="left">X<sub>BPO</sub></td>
<td class="left">f<sub>CV</sub><sub>BPO</sub></td>
<td class="left">f<sub>C</sub><sub>BPO</sub></td>
<td class="left">f<sub>N</sub><sub>BPO</sub></td>
<td class="left">f<sub>P</sub><sub>BPO</sub></td>
</tr>

<tr>
<td class="left">S<sub>UPO</sub></td>
<td class="left">f<sub>CV</sub><sub>UPO</sub></td>
<td class="left">f<sub>C</sub><sub>UPO</sub></td>
<td class="left">f<sub>N</sub><sub>UPO</sub></td>
<td class="left">f<sub>P</sub><sub>UPO</sub></td>
</tr>

<tr>
<td class="left">S<sub>USO</sub></td>
<td class="left">f<sub>CV</sub><sub>USO</sub></td>
<td class="left">f<sub>C</sub><sub>USO</sub></td>
<td class="left">f<sub>N</sub><sub>USO</sub></td>
<td class="left">f<sub>P</sub><sub>USO</sub></td>
</tr>

<tr>
<td class="left">X<sub>OHO</sub></td>
<td class="left">f<sub>CV</sub><sub>OHO</sub></td>
<td class="left">f<sub>C</sub><sub>OHO</sub></td>
<td class="left">f<sub>N</sub><sub>OHO</sub></td>
<td class="left">f<sub>P</sub><sub>OHO</sub></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Technologies</h3>
<div class="outline-text-3" id="text-1-2">
<p>
"Technologies" are methods of the state variables class. Each technology call creates an effluent and a wastage objects which are "state variables", and another object called "process variables".
</p>
</div>
<div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> Primary settler</h4>
<div class="outline-text-4" id="text-1-2-1">
</div><ol class="org-ol"><li><a id="sec-1-2-1-1" name="sec-1-2-1-1"></a>Inputs<br  /><div class="outline-text-5" id="text-1-2-1-1">
<ul class="org-ul">
<li>fw          (ø, fraction of input Q that goes to wastage)
</li>
<li>removal<sub>BPO</sub> (%, removal of X<sub>BPO</sub>)
</li>
<li>removal<sub>UPO</sub> (%, removal of X<sub>UPO</sub>)
</li>
<li>removal<sub>iSS</sub> (%, removal of X<sub>iSS</sub>)
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-1-2" name="sec-1-2-1-2"></a>Outputs<br  /><div class="outline-text-5" id="text-1-2-1-2">
<ul class="org-ul">
<li>Primary effluent (state variables object)
</li>
<li>Primary wastage (state variables object)
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> Activated Sludge</h4>
<div class="outline-text-4" id="text-1-2-2">
</div><ol class="org-ol"><li><a id="sec-1-2-2-1" name="sec-1-2-2-1"></a>Inputs<br  /><div class="outline-text-5" id="text-1-2-2-1">
<ul class="org-ul">
<li>T (ºC, temperature)
</li>
<li>Vp (m<sup>3</sup>, reactor volume)
</li>
<li>Rs (days, solids retention time or sludge age)
</li>
<li>RAS (ø, SST underflow recycle ratio)
</li>
<li>waste<sub>from</sub> (string, 'reactor' or 'sst')
</li>
<li>mass<sub>FeCl3</sub> (kgFeCl3, mass of FeCl3 added for chemical P removal)
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-2-2" name="sec-1-2-2-2"></a>Outputs (process variables)<br  /><div class="outline-text-5" id="text-1-2-2-2">
<ul class="org-ul">
<li>fSus        (gUSO/gCOD,   USO/COD ratio (influent))
</li>
<li>fSup        (gUPO/gCOD,   UPO/COD ratio (influent))
</li>
<li>Ns          (mgN/L,       N required for sludge production)
</li>
<li>Ps          (mgN/L,       P required for sludge production)
</li>
<li>HRT         (hour,        Nominal Hydraulic Retention Time)
</li>
<li>bHT         (1/d,         OHO Endogenous respiration rate corrected by temperature)
</li>
<li>f<sub>XBH</sub>       (gVSS·d/gCOD, OHO Biomass production rate)
</li>
<li>MX<sub>BH</sub>       (kgVSS,       OHO Biomass produced VSS)
</li>
<li>MX<sub>EH</sub>       (kgVSS,       OHO Endogenous residue VSS)
</li>
<li>MX<sub>I</sub>        (kgVSS,       Unbiodegradable organics VSS)
</li>
<li>MX<sub>V</sub>        (kgVSS,       Volatile Suspended Solids)
</li>
<li>MX<sub>IO</sub>       (kgiSS,       Inert Solids (influent+biomass))
</li>
<li>MX<sub>T</sub>        (kgTSS,       Total Suspended Solids)
</li>
<li>X<sub>V</sub>         (kgVSS/m3,    VSS concentration in SST)
</li>
<li>X<sub>T</sub>         (kgTSS/m3,    TSS concentration in SST)
</li>
<li>fi          (gVSS/gTSS,   VSS/TSS ratio)
</li>
<li>f<sub>avOHO</sub>     (gOHO/gVSS,   Active fraction of the sludge (VSS))
</li>
<li>f<sub>atOHO</sub>     (gOHO/gTSS,   Active fraction of the sludge (TSS))
</li>
<li>FOc         (kgO/d,       Carbonaceous Oxygen Demand)
</li>
<li>FOn         (kgO/d,       Nitrogenous Oxygen Demand)
</li>
<li>FOt         (kgO/d,       Total Oxygen Demand)
</li>
<li>OUR         (mgO/L·h,     Oxygen Uptake Rate)
</li>
<li>Qr          (ML/d,        SST recycle flowrate)
</li>
<li>f<sub>RAS</sub>       (ø,           SST concentrating factor)
</li>
<li>X<sub>RAS</sub>       (kg/m3,       SST recycle flow TSS concentration)
</li>
<li>f           (ø,           Wastage concentrating factor)
</li>
<li>COD<sub>balance</sub> (%,           COD balance)
</li>
<li>N<sub>balance</sub>   (%,           N balance)
</li>
<li>Nae<sub>balance</sub> (%,           Ammonia balance)
</li>
<li>P<sub>balance</sub>   (%,           P balance)
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> Chemical P removal</h4>
<div class="outline-text-4" id="text-1-2-3">
</div><ol class="org-ol"><li><a id="sec-1-2-3-1" name="sec-1-2-3-1"></a>Inputs<br  /><div class="outline-text-5" id="text-1-2-3-1">
<ul class="org-ul">
<li>Q (ML/d, flowrate)
</li>
<li>PO4i (mg/L, P available for chemical P removal, (calculated automatically in activated sludge function))
</li>
<li>mass<sub>FeCl3</sub> (kg/d FeCl3 added)
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-3-2" name="sec-1-2-3-2"></a>Outputs<br  /><div class="outline-text-5" id="text-1-2-3-2">
<ul class="org-ul">
<li>Fe<sub>P</sub><sub>mole</sub><sub>ratio</sub>  (molFe/molP, Fe/P mole ratio (Fe added for P available))
</li>
<li>PO4e             (mgP/L,      PO4 effluent)
</li>
<li>PO4<sub>removed</sub>      (kgP/d,      P removed)
</li>
<li>extra<sub>iSS</sub>        (kgiSS/d,    iSS produced by FeCl3 coprecipitation (Fe(OH)3 and Fe(1.6)H2PO4(OH)3.8))
</li>
</ul>
</div>
</li></ol>
</div>
