architecture/architecture.org
**** Inputs
- SF  (ø, safety factor)
- fxt (ø, current unaerated sludge mass fraction)
- DO  (mg/L, DO in the aerobic reactor)
- pH  (pH units)
**** Outputs
- uAmT   (1/d,         Growth rate corrected by temperature)
- uAmO   (1/d,         Growth rate corrected by: temperature + DO available)
- uAm_pH (1/d,         Growth rate corrected by: temperature + DO available + pH)
- KnT    (mg/L,        Half saturation constant corrected by temperature)
- bAT    (1/d,         Growth rate corrected by temperature)
- f_XBA  (gVSS·d/gCOD, Nitrifiers Biomass production rate)
- MX_BA  (kgVSS,       Mass of Nitrifiers)
- X_BA   (kgVSS/m3,    Concentration of Nitrifiers)
- fxt    (ø,           Current unaerated sludge mass fraction)
- fxm    (ø,           Maximum design unaerated sludge mass fraction)
- Rs     (d,           Current sludge age)
- Rsm    (d,           Minimum sludge age for nitrification (below which theoretically nitrification cannot be achiveved))
- Nae    (mgN/L,       Effluent ammonia concentration (if fxt < fxm))
- Nte    (mgN/L,       Effluent TKN concentration (if fxt < fxm))
- Nc     (mgN/L,       Nitrification capacity (if fxt < fxm))
- FOn    (kgO/d,       Nitrogenous Oxygen demand (if fxt < fxm))
- FOt    (kgO/d,       Total Oxygen demand (if fxt < fxm))
- OUR    (mgO/L·h,     Oxygen Uptake Rate (if fxt < fxm))
*** Denitrification
**** Inputs
- IR           (ø, internal recirculation ratio)
- DO_RAS       (mgO/L, DO in the underflow recycle)
- influent_alk (mg/L as CaCO3, influent alkalinity)
**** Outputs (process variables)
- K2T          (gN/gVSS  , K denitrification rate 2)
- fSb_s        (gBSO/gBO , BSO/(BSO+BPO) ratio)
- Dp1          (mgN/L    , Denitrification potential)
- a            (ø        , IR (internal recirculation ratio))
- a_opt        (ø        , optimal IR)
- Nne          (mgN/L    , Effluent nitrate)
- Nne_opt      (mgN/L    , Lowest effluent nitrate (using a_opt))
- TNe          (mgN/L    , Effluent total nitrogen)
- FOd          (kgO/d    , Oxygen recovered by denitrification)
- FOt          (kgO/d    , Total oxygen demand (FOc + FOn - FOd))
- OUR          (mgO/L·h  , Oxygen Uptake Rate)
- effluent_alk (mgCaCO3/L, Effluent alkalinity)
- FN2g         (kgN/d    , N2 gas production (mass flux))
- TOD_balance  (%        , Total oxygen demand balance (out/in))
- N_balance    (%        , Nitrogen balance (out/in))
** Outputs
*** Totals
"Totals" is a data structure with a complete fractionation for COD, TOC, TKN, TP and TSS.
Fractions are divided into inorganic/organic. The organic fractions is further divided into biodegradable/unbiodegradable, soluble/particulated and the active fraction corresponding to the VSS biomass (OHO).
All fractions are calculated using input state variables and mass ratios.
**** COD (chemical oxygen demand)
***** COD fractions
|                     | Biodegradable | Unbiodegradable |
|                     | (bCOD)        | (uCOD)          |
|---------------------+---------------+-----------------|
| Soluble (sCOD)      | bsCOD         | usCOD           |
| Particulated (pCOD) | bpCOD         | upCOD           |
|---------------------+---------------+-----------------|
***** Active COD (COD in X_OHO)
**** TOC (total organic carbon)
All carbon considered in this model is organic (model assumption).
***** Organic C (OC) fractions
|                     | Biodegradable | Unbiodegradable |
|                     | (bOC)         | (uOC)           |
|---------------------+---------------+-----------------|
| Soluble (sOC)       | bsOC          | usOC            |
| Particulated (pOC)  | bpOC          | upOC            |
|---------------------+---------------+-----------------|
***** Active OC (OC in X_OHO)
**** TKN (total kjeldahl nitrogen)
***** Inorganic N (NH_4, Free Saline Ammonia, S_FSA)
***** Organic N (ON) fractions
|                     | Biodegradable | Unbiodegradable |
|                     | (bON)         | (uON)           |
|---------------------+---------------+-----------------|
| Soluble (sON)       | bsON          | usON            |
| Particulated (pON)  | bpON          | upON            |
|---------------------+---------------+-----------------|
***** Active N (ON in X_OHO)
**** TP (total phosphorus)
***** Inorganic P (PO_4, Orthophosphate, S_OP)
***** Organic P (OP) fractions
|                     | Biodegradable | Unbiodegradable |
|                     | (bOP)         | (uOP)           |
|---------------------+---------------+-----------------|
| Soluble (sOP)       | bsOP          | usOP            |
| Particulated (pOP)  | bpOP          | upOP            |
|---------------------+---------------+-----------------|
***** Active P (OP in X_OHO)
**** TSS (total suspended solids)
***** iSS (inorganic/inert SS)
***** VSS (volatile suspended solids)
- bVSS (biodegradable VSS)
- uVSS (unbiodegradable VSS)
- Active SS (X_OHO VSS)
*** Fluxes
This function takes all concentrations (mg/L, inputs and outputs) and converts them to mass fluxes (kg/d) using the flowrate (Q).
* Kinetic constants
