architecture/architecture.html
<div id="outline-container-sec-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> Nitrification</h4>
<div class="outline-text-4" id="text-1-2-4">
</div><ol class="org-ol"><li><a id="sec-1-2-4-1" name="sec-1-2-4-1"></a>Inputs<br  /><div class="outline-text-5" id="text-1-2-4-1">
<ul class="org-ul">
<li>SF  (ø, safety factor)
</li>
<li>fxt (ø, current unaerated sludge mass fraction)
</li>
<li>DO  (mg/L, DO in the aerobic reactor)
</li>
<li>pH  (pH units)
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-4-2" name="sec-1-2-4-2"></a>Outputs<br  /><div class="outline-text-5" id="text-1-2-4-2">
<ul class="org-ul">
<li>uAmT   (1/d,         Growth rate corrected by temperature)
</li>
<li>uAmO   (1/d,         Growth rate corrected by: temperature + DO available)
</li>
<li>uAm<sub>pH</sub> (1/d,         Growth rate corrected by: temperature + DO available + pH)
</li>
<li>KnT    (mg/L,        Half saturation constant corrected by temperature)
</li>
<li>bAT    (1/d,         Growth rate corrected by temperature)
</li>
<li>f<sub>XBA</sub>  (gVSS·d/gCOD, Nitrifiers Biomass production rate)
</li>
<li>MX<sub>BA</sub>  (kgVSS,       Mass of Nitrifiers)
</li>
<li>X<sub>BA</sub>   (kgVSS/m3,    Concentration of Nitrifiers)
</li>
<li>fxt    (ø,           Current unaerated sludge mass fraction)
</li>
<li>fxm    (ø,           Maximum design unaerated sludge mass fraction)
</li>
<li>Rs     (d,           Current sludge age)
</li>
<li>Rsm    (d,           Minimum sludge age for nitrification (below which theoretically nitrification cannot be achiveved))
</li>
<li>Nae    (mgN/L,       Effluent ammonia concentration (if fxt &lt; fxm))
</li>
<li>Nte    (mgN/L,       Effluent TKN concentration (if fxt &lt; fxm))
</li>
<li>Nc     (mgN/L,       Nitrification capacity (if fxt &lt; fxm))
</li>
<li>FOn    (kgO/d,       Nitrogenous Oxygen demand (if fxt &lt; fxm))
</li>
<li>FOt    (kgO/d,       Total Oxygen demand (if fxt &lt; fxm))
</li>
<li>OUR    (mgO/L·h,     Oxygen Uptake Rate (if fxt &lt; fxm))
</li>
</ul>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-2-5" class="outline-4">
<h4 id="sec-1-2-5"><span class="section-number-4">1.2.5</span> Denitrification</h4>
<div class="outline-text-4" id="text-1-2-5">
</div><ol class="org-ol"><li><a id="sec-1-2-5-1" name="sec-1-2-5-1"></a>Inputs<br  /><div class="outline-text-5" id="text-1-2-5-1">
<ul class="org-ul">
<li>IR           (ø, internal recirculation ratio)
</li>
<li>DO<sub>RAS</sub>       (mgO/L, DO in the underflow recycle)
</li>
<li>influent<sub>alk</sub> (mg/L as CaCO3, influent alkalinity)
</li>
</ul>
</div>
</li>
<li><a id="sec-1-2-5-2" name="sec-1-2-5-2"></a>Outputs (process variables)<br  /><div class="outline-text-5" id="text-1-2-5-2">
<ul class="org-ul">
<li>K2T          (gN/gVSS  , K denitrification rate 2)
</li>
<li>fSb<sub>s</sub>        (gBSO/gBO , BSO/(BSO+BPO) ratio)
</li>
<li>Dp1          (mgN/L    , Denitrification potential)
</li>
<li>a            (ø        , IR (internal recirculation ratio))
</li>
<li>a<sub>opt</sub>        (ø        , optimal IR)
</li>
<li>Nne          (mgN/L    , Effluent nitrate)
</li>
<li>Nne<sub>opt</sub>      (mgN/L    , Lowest effluent nitrate (using a<sub>opt</sub>))
</li>
<li>TNe          (mgN/L    , Effluent total nitrogen)
</li>
<li>FOd          (kgO/d    , Oxygen recovered by denitrification)
</li>
<li>FOt          (kgO/d    , Total oxygen demand (FOc + FOn - FOd))
</li>
<li>OUR          (mgO/L·h  , Oxygen Uptake Rate)
</li>
<li>effluent<sub>alk</sub> (mgCaCO3/L, Effluent alkalinity)
</li>
<li>FN2g         (kgN/d    , N2 gas production (mass flux))
</li>
<li>TOD<sub>balance</sub>  (%        , Total oxygen demand balance (out/in))
</li>
<li>N<sub>balance</sub>    (%        , Nitrogen balance (out/in))
</li>
</ul>
</div>
</li></ol>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Outputs</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> Totals</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
"Totals" is a data structure with a complete fractionation for COD, TOC, TKN, TP and TSS.
Fractions are divided into inorganic/organic. The organic fractions is further divided into biodegradable/unbiodegradable, soluble/particulated and the active fraction corresponding to the VSS biomass (OHO).
All fractions are calculated using input state variables and mass ratios.
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-3-1-1" name="sec-1-3-1-1"></a>COD (chemical oxygen demand)<br  /><ol class="org-ol"><li><a id="sec-1-3-1-1-1" name="sec-1-3-1-1-1"></a>COD fractions<br  /><div class="outline-text-6" id="text-1-3-1-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Biodegradable</th>
<th scope="col" class="left">Unbiodegradable</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">(bCOD)</th>
<th scope="col" class="left">(uCOD)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Soluble (sCOD)</td>
<td class="left">bsCOD</td>
<td class="left">usCOD</td>
</tr>

<tr>
<td class="left">Particulated (pCOD)</td>
<td class="left">bpCOD</td>
<td class="left">upCOD</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="sec-1-3-1-1-2" name="sec-1-3-1-1-2"></a>Active COD (COD in X<sub>OHO</sub>)<br  /></li></ol>
</li>
<li><a id="sec-1-3-1-2" name="sec-1-3-1-2"></a>TOC (total organic carbon)<br  /><div class="outline-text-5" id="text-1-3-1-2">
<p>
All carbon considered in this model is organic (model assumption).
</p>
</div>
<ol class="org-ol"><li><a id="sec-1-3-1-2-1" name="sec-1-3-1-2-1"></a>Organic C (OC) fractions<br  /><div class="outline-text-6" id="text-1-3-1-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Biodegradable</th>
<th scope="col" class="left">Unbiodegradable</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">(bOC)</th>
<th scope="col" class="left">(uOC)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Soluble (sOC)</td>
<td class="left">bsOC</td>
<td class="left">usOC</td>
</tr>

<tr>
<td class="left">Particulated (pOC)</td>
<td class="left">bpOC</td>
<td class="left">upOC</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="sec-1-3-1-2-2" name="sec-1-3-1-2-2"></a>Active OC (OC in X<sub>OHO</sub>)<br  /></li></ol>
</li>
<li><a id="sec-1-3-1-3" name="sec-1-3-1-3"></a>TKN (total kjeldahl nitrogen)<br  /><ol class="org-ol"><li><a id="sec-1-3-1-3-1" name="sec-1-3-1-3-1"></a>Inorganic N (NH<sub>4</sub>, Free Saline Ammonia, S<sub>FSA</sub>)<br  /></li>
<li><a id="sec-1-3-1-3-2" name="sec-1-3-1-3-2"></a>Organic N (ON) fractions<br  /><div class="outline-text-6" id="text-1-3-1-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Biodegradable</th>
<th scope="col" class="left">Unbiodegradable</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">(bON)</th>
<th scope="col" class="left">(uON)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Soluble (sON)</td>
<td class="left">bsON</td>
<td class="left">usON</td>
</tr>

<tr>
<td class="left">Particulated (pON)</td>
<td class="left">bpON</td>
<td class="left">upON</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="sec-1-3-1-3-3" name="sec-1-3-1-3-3"></a>Active N (ON in X<sub>OHO</sub>)<br  /></li></ol>
</li>
<li><a id="sec-1-3-1-4" name="sec-1-3-1-4"></a>TP (total phosphorus)<br  /><ol class="org-ol"><li><a id="sec-1-3-1-4-1" name="sec-1-3-1-4-1"></a>Inorganic P (PO<sub>4</sub>, Orthophosphate, S<sub>OP</sub>)<br  /></li>
<li><a id="sec-1-3-1-4-2" name="sec-1-3-1-4-2"></a>Organic P (OP) fractions<br  /><div class="outline-text-6" id="text-1-3-1-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">Biodegradable</th>
<th scope="col" class="left">Unbiodegradable</th>
</tr>

<tr>
<th scope="col" class="left">&#xa0;</th>
<th scope="col" class="left">(bOP)</th>
<th scope="col" class="left">(uOP)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Soluble (sOP)</td>
<td class="left">bsOP</td>
<td class="left">usOP</td>
</tr>

<tr>
<td class="left">Particulated (pOP)</td>
<td class="left">bpOP</td>
<td class="left">upOP</td>
</tr>
</tbody>
</table>
</div>
</li>
<li><a id="sec-1-3-1-4-3" name="sec-1-3-1-4-3"></a>Active P (OP in X<sub>OHO</sub>)<br  /></li></ol>
</li>
<li><a id="sec-1-3-1-5" name="sec-1-3-1-5"></a>TSS (total suspended solids)<br  /><ol class="org-ol"><li><a id="sec-1-3-1-5-1" name="sec-1-3-1-5-1"></a>iSS (inorganic/inert SS)<br  /></li>
<li><a id="sec-1-3-1-5-2" name="sec-1-3-1-5-2"></a>VSS (volatile suspended solids)<br  /><div class="outline-text-6" id="text-1-3-1-5-2">
<ul class="org-ul">
<li>bVSS (biodegradable VSS)
</li>
<li>uVSS (unbiodegradable VSS)
</li>
<li>Active SS (X<sub>OHO</sub> VSS)
</li>
</ul>
</div>
</li></ol>
</li></ol>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> Fluxes</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
This function takes all concentrations (mg/L, inputs and outputs) and converts them to mass fluxes (kg/d) using the flowrate (Q).
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Kinetic constants</h2>
