architecture/architecture.org
** Activated sludge
| YH          | 0.450 gVSS/gCOD | heterotrophic yield (not affected by temperature) |
| bH          | 0.240 1/d       | heterotrophic endogenous respiration rate at 20ºC |
| theta_bH    | 1.029 ø         | bH temperature correction factor                  |
| k_v20       | 0.070 L/mgVSS·d | constant for not degraded bCOD (FBSO)             |
| theta_k_v20 | 1.035 ø         | k_v20 temperature correction factor               |
| fH          | 0.200 ø         | heterotrophic endogenous residue fraction         |
| f_iOHO      | 0.150 giSS/gVSS | iSS content of OHOs                               |
** Nitrification
| uAm       | 0.450 1/d       | autotrophic max specific growth rate at 20ºC    |
| theta_uAm | 1.123 ø         | uAm temperature correction factor               |
| K_O       | 0.400 mgDO/L    | autotrophic DO uA sensitivity constant          |
| theta_pH  | 2.350 ø         | autotrophic ph sensitivity coefficient          |
| Ki        | 1.130 ø         | autotrophic ph inhibition to uA                 |
| Kii       | 0.300 ø         | autotrophic ph inhibition to uA                 |
| Kmax      | 9.500 ø         | autotrophic ph inhibition to uA                 |
| YA        | 0.100 gVSS/gFSA | autotrophic yield                               |
| Kn        | 1.000 mgN/L     | ammonia half saturation coefficient at 20ºC     |
| theta_Kn  | 1.123 ø         | Kn temperature correction factor                |
| bA        | 0.040 1/d       | autotrophic endogenous respiration rate at 20ºC |
| theta_bA  | 1.029 ø         | bA temperature correction factor                |
** Denitrification
| K2_20    | 0.101 gN/gVSS·d | at 20ºC page 482 and 113                |
| theta_K2 | 1.080 ø         | temperature correction factor for K2_20 |
* Class: Plant
** Inputs
*** Influent (state variables object)
*** Configuration object
for example: {pst:true, nit:true, dn:true, cpr:true}
- "pst" stands for primary settler
- "nit" stands for nitrification
- "dn"  stands for denitrification
- "cpr" stands for chemical P removal
*** Parameters object
Object with all inputs for each technology (see State Variables/Technologies)
** Outputs
*** Process variables (varies with configuration, depending on the technologies activated)
Object
*** Effluents
**** Primary effluent
State variables object (it is equal to influent if configuration.pst==false).
**** Secondary effluent
State variables object
*** Wastages
**** Primary wastage
State variables object (it is null if configuration.pst==false)
**** Secondary wastage
State variables object
*** Possible errors (array of strings)
- Certain combinations of inputs could generate not desired process variables (results).
- For example:
['fxt > fxm', 'Rs < Rsm'].

