architecture/architecture.html
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Activated sludge</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">YH</td>
<td class="left">0.450 gVSS/gCOD</td>
<td class="left">heterotrophic yield (not affected by temperature)</td>
</tr>

<tr>
<td class="left">bH</td>
<td class="left">0.240 1/d</td>
<td class="left">heterotrophic endogenous respiration rate at 20ºC</td>
</tr>

<tr>
<td class="left">theta<sub>bH</sub></td>
<td class="left">1.029 ø</td>
<td class="left">bH temperature correction factor</td>
</tr>

<tr>
<td class="left">k<sub>v20</sub></td>
<td class="left">0.070 L/mgVSS·d</td>
<td class="left">constant for not degraded bCOD (FBSO)</td>
</tr>

<tr>
<td class="left">theta<sub>k</sub><sub>v20</sub></td>
<td class="left">1.035 ø</td>
<td class="left">k<sub>v20</sub> temperature correction factor</td>
</tr>

<tr>
<td class="left">fH</td>
<td class="left">0.200 ø</td>
<td class="left">heterotrophic endogenous residue fraction</td>
</tr>

<tr>
<td class="left">f<sub>iOHO</sub></td>
<td class="left">0.150 giSS/gVSS</td>
<td class="left">iSS content of OHOs</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> Nitrification</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">uAm</td>
<td class="left">0.450 1/d</td>
<td class="left">autotrophic max specific growth rate at 20ºC</td>
</tr>

<tr>
<td class="left">theta<sub>uAm</sub></td>
<td class="left">1.123 ø</td>
<td class="left">uAm temperature correction factor</td>
</tr>

<tr>
<td class="left">K<sub>O</sub></td>
<td class="left">0.400 mgDO/L</td>
<td class="left">autotrophic DO uA sensitivity constant</td>
</tr>

<tr>
<td class="left">theta<sub>pH</sub></td>
<td class="left">2.350 ø</td>
<td class="left">autotrophic ph sensitivity coefficient</td>
</tr>

<tr>
<td class="left">Ki</td>
<td class="left">1.130 ø</td>
<td class="left">autotrophic ph inhibition to uA</td>
</tr>

<tr>
<td class="left">Kii</td>
<td class="left">0.300 ø</td>
<td class="left">autotrophic ph inhibition to uA</td>
</tr>

<tr>
<td class="left">Kmax</td>
<td class="left">9.500 ø</td>
<td class="left">autotrophic ph inhibition to uA</td>
</tr>

<tr>
<td class="left">YA</td>
<td class="left">0.100 gVSS/gFSA</td>
<td class="left">autotrophic yield</td>
</tr>

<tr>
<td class="left">Kn</td>
<td class="left">1.000 mgN/L</td>
<td class="left">ammonia half saturation coefficient at 20ºC</td>
</tr>

<tr>
<td class="left">theta<sub>Kn</sub></td>
<td class="left">1.123 ø</td>
<td class="left">Kn temperature correction factor</td>
</tr>

<tr>
<td class="left">bA</td>
<td class="left">0.040 1/d</td>
<td class="left">autotrophic endogenous respiration rate at 20ºC</td>
</tr>

<tr>
<td class="left">theta<sub>bA</sub></td>
<td class="left">1.029 ø</td>
<td class="left">bA temperature correction factor</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> Denitrification</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">K2<sub>20</sub></td>
<td class="left">0.101 gN/gVSS·d</td>
<td class="left">at 20ºC page 482 and 113</td>
</tr>

<tr>
<td class="left">theta<sub>K2</sub></td>
<td class="left">1.080 ø</td>
<td class="left">temperature correction factor for K2<sub>20</sub></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Class: Plant</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Inputs</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> Influent (state variables object)</h4>
</div>
<div id="outline-container-sec-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> Configuration object</h4>
<div class="outline-text-4" id="text-3-1-2">
<p>
for example: {pst:true, nit:true, dn:true, cpr:true}
</p>
<ul class="org-ul">
<li>"pst" stands for primary settler
</li>
<li>"nit" stands for nitrification
</li>
<li>"dn"  stands for denitrification
</li>
<li>"cpr" stands for chemical P removal
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-1-3" class="outline-4">
<h4 id="sec-3-1-3"><span class="section-number-4">3.1.3</span> Parameters object</h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
Object with all inputs for each technology (see State Variables/Technologies)
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Outputs</h3>
<div class="outline-text-3" id="text-3-2">
</div><div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> Process variables (varies with configuration, depending on the technologies activated)</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Object
</p>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> Effluents</h4>
<div class="outline-text-4" id="text-3-2-2">
</div><ol class="org-ol"><li><a id="sec-3-2-2-1" name="sec-3-2-2-1"></a>Primary effluent<br  /><div class="outline-text-5" id="text-3-2-2-1">
<p>
State variables object (it is equal to influent if configuration.pst==false).
</p>
</div>
</li>
<li><a id="sec-3-2-2-2" name="sec-3-2-2-2"></a>Secondary effluent<br  /><div class="outline-text-5" id="text-3-2-2-2">
<p>
State variables object
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> Wastages</h4>
<div class="outline-text-4" id="text-3-2-3">
</div><ol class="org-ol"><li><a id="sec-3-2-3-1" name="sec-3-2-3-1"></a>Primary wastage<br  /><div class="outline-text-5" id="text-3-2-3-1">
<p>
State variables object (it is null if configuration.pst==false)
</p>
</div>
</li>
<li><a id="sec-3-2-3-2" name="sec-3-2-3-2"></a>Secondary wastage<br  /><div class="outline-text-5" id="text-3-2-3-2">
<p>
State variables object
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-3-2-4" class="outline-4">
<h4 id="sec-3-2-4"><span class="section-number-4">3.2.4</span> Possible errors (array of strings)</h4>
<div class="outline-text-4" id="text-3-2-4">
<ul class="org-ul">
<li>Certain combinations of inputs could generate not desired process variables (results).
</li>
<li>For example:
</li>
</ul>
<p>
['fxt &gt; fxm', 'Rs &lt; Rsm'].
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Lluís Bosch</p>
<p class="date">Created: 2019-01-14 lun 17:41</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
